app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => :name)
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `hashed_password`, `created_at`) VALUES('hugop92', '371474200.474604676544755', '2009-04-16 12:13:36', '9d02c8674d7303d9c27bd4ce84abd07706d862ae', '2009-04-16 12:13:36')